<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"prod","backend":"80f565312071d94e172dc8275309bf4ec9acc154a6915018e298f0bb5c3b38f3","plan_job_ref":"Job Build and Deploy #4 at https://github.com/swibrow/actions-playground/actions/runs/8534411546","plan_out_hash":"5b18a62e883aa5b85cb2110b701a7fafc8568652fd4e8265be7c2068c7b92014","plan_hash":"76debfbf3b1a3406bfc9368cdda5396ffad846b6d470b2e02dbfe480c30bb6af","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan for __prod__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)

Warning: Value for undeclared variable

The root module does not declare a variable named "image_tag" but a value was
found in file "/tmp/variables.tfvars". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.
```
</details>

:memo: Plan generated in [Build and Deploy #4](https://github.com/swibrow/actions-playground/actions/runs/8534411546)